package lessons.lesson14;

public class Homework {
    public static void main(String[] args) {
/*  1: Введи с клавиатуры 5 слов в список строк.
        Удали 3-ий элемент списка, и выведи оставшиеся элементы в обратном порядке.

    2: 1. Создай список из слов "мама", "мыла", "раму".
       2. После каждого слова вставь в список строку, содержащую слово "именно".
       3. Вывести результат на экран, каждый элемент списка с новой строки.

    3:
        1. Создай список слов, заполни его самостоятельно.
        2. Метод fix должен:
        2.1. удалять из списка строк все слова, содержащие букву "р"
        2.2. удваивать все слова содержащие букву "л".
        2.3. если слово содержит и букву "р" и букву "л", то оставить это слово без изменений.
        2.4. с другими словами ничего не делать.

        public static void main(String[] args) {
            ArrayList<String> strings = new ArrayList<String>();
            strings.add("роза");
            strings.add("лоза");
            strings.add("лира");
            strings = fix(strings);

            for (String string : strings) {
                System.out.println(string);
            }
        }

        public static ArrayList<String> fix(ArrayList<String> strings) {
            //напишите тут ваш код
            return null;
        }

     4: 1. Введи с клавиатуры 10 слов в список строк.
        2. Метод doubleValues должен удваивать слова по принципу:
        "альфа", "бета", "гамма" -> "альфа", "альфа", "бета", "бета", "гамма", "гамма"
        3. Выведи результат на экран, каждое значение с новой строки.

     5: 1. Введи с клавиатуры 10 слов в список строк.
        2. Определить, является ли список упорядоченным по возрастанию длины строки.
        3. В случае отрицательного ответа вывести на экран индекс первого элемента, нарушающего такую упорядоченность.*/

    }
}
